HanielUlises/Embedded/STM32/UART_TX/Src/main.c
#include <stdint.h>
#include "stm32f4xx.h"

#define GPIOAEN 		(1U << 0)
#define UART2EN			(1U << 17)

#define CR1_TE			(1U << 3)
#define CR1_UE			(1U << 13)
#define SR_TXE			(1U << 7)

#define SYS_FREQ		16000000
#define APB1_CLK		SYS_FREQ

#define UART_BAUDRATE	115200

static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate) {
	return ((PeriphClk + (BaudRate/2U)) / BaudRate);
}

static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk, uint32_t BaudRate) {
	USARTx -> BRR = compute_uart_bd(PeriphClk, BaudRate);
}


void uar2_tx_init(void) {
	/************Configure uart gpio pin*************/
	// Enable clock access to gpioa
	RCC -> AHB1ENR |= GPIOAEN;
	// set PA2 mode to alternate function mode
	GPIOA -> MODER &= ~(3U << 4);
	GPIOA -> MODER |=  (2U << 4);

	// set PA2 alternate function type to UART_TX (AF07)
	GPIOA -> AFR[0] |= (1U << 8);
	GPIOA -> AFR[0] |= (1U << 9);
	GPIOA -> AFR[0] |= (1U << 10);
	GPIOA -> AFR[0] &= ~(1U << 11);

	// Enable clock access to uart2
	RCC -> APB1ENR |= UART2EN;

	// Configure baudrate
	uart_set_baudrate(USART2, APB1_CLK, UART_BAUDRATE);
	// Configure the transfer direction
	USART2 -> CR1 = CR1_TE;
	// Enable uart module
	USART2 -> CR1 |= CR1_UE;
}

void uart2_write(int ch) {
	// Make sure the transmit data register is empty
	while(!(USART2 -> SR & SR_TXE)){}
	// Write to transmit data register
	USART2 -> DR = (ch & 0xFF);
}

int main(void) {
	uar2_tx_init();
	while(1) {
		uart2_write('Y');
	}
}
